
## Plan Result (account-data-deleter-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/97307)


<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09
* Update
  * aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B
  * aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B will be updated in-place
  ~ resource "aws_lambda_function" "batchdeletelambda_batch-delete-lambda_9A38729B" {
        id                             = "AccountDataDeleter-Prod-BatchDeleteLambda-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function:553" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function:553/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
      ~ version                        = "553" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"     = (sensitive value) -> null
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C will be updated in-place
  ~ resource "aws_lambda_function" "event-consumer_sqs-event-consumer_lambda_2F35855C" {
        id                             = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function:786" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function:786/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
      ~ version                        = "786" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                      = (sensitive value) -> null
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09 will be created
  + resource "local_file" "data-deleter-app_application_ecs_service_appspec_5FC42C09" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4015
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:534"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + batchdeletelambda_batch-delete-lambda_lambda-code-deploy_lambda_codedeploy_app_7744F91F   = "AccountDataDeleter-Prod-BatchDeleteLambda-Lambda"
  + batchdeletelambda_batch-delete-lambda_lambda-code-deploy_lambda_codedeploy_group_68667691 = "AccountDataDeleter-Prod-BatchDeleteLambda-Lambda"
  + batchdeletelambda_batch-delete-lambda_lambda_arn_3861F79C                                 = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function"
  + batchdeletelambda_batch-delete-lambda_lambda_function_name_BCEA92F4                       = "AccountDataDeleter-Prod-BatchDeleteLambda-Function"
  + batchdeletelambda_batch-delete-lambda_lambda_version_arn_7EFCF346                         = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-BatchDeleteLambda-Function:DEPLOYED"
  + event-consumer_sqs-event-consumer_lambda-code-deploy_lambda_codedeploy_app_64C8411E       = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Lambda"
  + event-consumer_sqs-event-consumer_lambda-code-deploy_lambda_codedeploy_group_44C6E72F     = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Lambda"
  + event-consumer_sqs-event-consumer_lambda_lambda_arn_F37E7A74                              = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
  + event-consumer_sqs-event-consumer_lambda_lambda_function_name_73865498                    = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
  + event-consumer_sqs-event-consumer_lambda_lambda_version_arn_99493C4A                      = "arn:aws:lambda:us-east-1:996905175585:function:AccountDataDeleter-Prod-Sqs-Event-Consumer-Function:DEPLOYED"
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"3108804f-92a5-4afd-bae5-3fd0580840cc","JobName":"account-data-deleter_infrastructure_plan_prod","PRNumber":329,"Program":"tfcmt","SHA1":"63ab645f13cf50a53b56a8235344fc45f0b9c23b","Target":"account-data-deleter-cdk","Vars":{}} -->